"""Хеш функция представляет собой функцию, которая получает строку(любые данных-последовательность данных)
и возвращает число

Требования к хеш-функции:
-Последовательность, ключу должно соответствовать определенное(индивидуальное)
 значение

 -Хеш функция неизменно связывает название с одним индексом
 -Хеш функция связывает разные данные с разными индексами
 -Хеш функция знает размер массива и возвращает только действительные индексы
 -Связанные хеш-функции и массив - структура данных которая называется хеш-таблица
 -Хеш-таблицы в python - словари(dict)
 -Хеш таблица состоит из ключа и значения

 Поиск О(1)
 Вставка О(1)
 Удаление О(1)"""

